Autodesk.Revit.DB.BuiltInFailures.ElementTypeFailures.WarnLastType1
Last type in system family '[Name]' cannot be deleted.

Autodesk.Revit.DB.BuiltInFailures.ElementTypeFailures.NoDefaultType
As a result of Reloading Latest, there are no types of [User Name] left.  Create a new type by duplicating an existing [User Name] type in the Project Browser.

Autodesk.Revit.DB.BuiltInFailures.ElementTypeFailures
Failures about ElementTypeFailures.